master/cases/halle/2D/spray_4/lowMach.coarse/constant/injectorProperties
/*---------------------------------------------------------------------------*\ 
| =========                 |                                                 | 
| \      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           | 
|  \    /   O peration     | Version:  1.6                                   | 
|   \  /    A nd           | Web:      http://www.openfoam.org               | 
|    \/     M anipulation  |                                                 | 
\*---------------------------------------------------------------------------*/ 

FoamFile 
{    version         2.0; 
    format          ascii; 

    root            "";
    case            "";
    instance        "";
    local           "";

    class           dictionary; 
    object          injectorProperties;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * // 
(

    {
        injectorType        definedInjector;
        definedInjectorProps
        {
            position        (1e-4 0 1e-4);
            direction       (0 0 1);
            diameter        0.016;
            Cd              1.0;
            mass            0.83e-3;
            nParcels        1;
            temperature     308.0;
            X ( 1.0 );
            
            massFlowRateProfile 
            (
                (0.0     1)
                (1.0     1)
           );
            temperatureProfile 
            (
                (0.0     308.0)
                (1.0     308.0)
           );
            velocityProfile 
            (
                (0.0     12.75)
                (1.0     12.75)
           );
        }
    }
// ------------------------------------------------------------------------- 
)
