master/cases/halle/2D/spray_4/lowMach.coarse/0/pd
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.7.x                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      pd;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -1 -2 0 0 0 0];

internalField   nonuniform List<scalar> 
11750
(
100003
100003
100003
100003
100003
100003
100003
100003
...
)
;

boundaryField
{
    inlet
    {
        type            zeroGradient;
    }
    walls
    {
        type            zeroGradient;
    }
    back
    {
        type            wedge;
    }
    front
    {
        type            wedge;
    }
    outlet
    {
		type			fixedValue;
		value			uniform 1.0e+5;
/*
        type            totalPressure;
		gamma 			1.4;
		p0 				uniform 1.0e+5;
        value           uniform 1.0e+5;
*/
    }
    defaultFaces
    {
        type            empty;
    }
}


// ************************************************************************* //
