master/cases/halle/2D/spray_4/lowMach.coarse/0/k
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.7.x                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "1750";
    object      k;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   nonuniform List<scalar> 
11750
(
0.557089
0.0956847
0.0133923
0.00223725
0.00103048
0.00097478
0.000994595
0.00100509
...
)
;

boundaryField
{
    inlet
    {
        type            fixedValue;
        value           uniform 0.001;
    }
    walls
    {
        type            compressible::kqRWallFunction;
        value           nonuniform List<scalar> 
245
(
0.557089
0.62744
0.59968
0.575397
0.564058
0.56029
0.55978
0.560485
...
)
;
    }
    back
    {
        type            wedge;
    }
    front
    {
        type            wedge;
    }
    outlet
    {
        type            zeroGradient;
    }
    defaultFaces
    {
        type            empty;
    }
}


// ************************************************************************* //
